[PrimaryLauncher X2GrenadeLauncherTemplate]
FriendlyName="绝望倾泻炮"
FriendlyNamePlural="绝望倾泻炮"
BriefSummary="绝望倾泻炮是一种纯洁圣女专用的特殊武器，它利用纯洁圣女的绝望能量转换为一种无视距离的规模性杀伤武器，由于科技的限制，转化率并不理想，只有献祭足够数量的灵魂才能将消耗一空的这种倾泻器重新填满"
TacticalText="<Bullet/> 附加手榴弹伤害：1\n<Bullet/> 绝望倾泻炮是榴弹发射器的变异版本。\n<Bullet/>绝望倾泻炮具有非常强大的火力，但无法以任何方式重新装填。\n<Bullet/>绝望倾泻炮只需拥有它就可以增加魔法少女手榴弹的伤害，经过特殊训练的魔法少女可以通过它发射手榴弹。"
AbilityDescName="绝望倾泻炮"

[PrimaryLauncher_MG X2GrenadeLauncherTemplate]
FriendlyName="绝望压缩炮"
FriendlyNamePlural="绝望压缩炮"
BriefSummary="绝望压缩炮是一种纯洁圣女专用的特殊武器，现在利用外星人的磁力科技将绝望转器的转换率进一步提高并将多余的绝望能量进一步压缩使其带来更高的伤害，只有献祭足够数量的灵魂才能将消耗一空的这种倾泻器重新填满"
TacticalText="<Bullet/> 附加手榴弹伤害：2\n<Bullet/>绝望压缩炮是高级榴弹发射器的变异版本。\n<Bullet/>绝望压缩炮仍然无法重新加载。这在未来不会改变。\n<Bullet/>绝望压缩炮只需拥有它就可以增加魔法少女手榴弹的伤害，经过特殊训练的魔法少女可以通过它发射手榴弹。"
AbilityDescName="绝望压缩炮"

[PrimaryLauncher_BM X2GrenadeLauncherTemplate]
FriendlyName="绝望黑洞炮"
FriendlyNamePlural="绝望黑洞炮"
BriefSummary="绝望黑洞炮是一种纯洁圣女专用的特殊武器，成功破解长老的空间技术后，将过去，现在以及未来的绝望以黑洞般的能量装填进这个容器之中，只为了将敌人从这个世间彻底抹除。"
TacticalText="<Bullet/> 额外手榴弹伤害：3\n<Bullet/>绝望粒子黑洞炮是超釉榴弹发射器的终极版本。\n<Bullet/> 在战场上重新装弹是不可能的。\n<Bullet/>绝望粒子黑洞炮只要拥有它就可以增加魔法少女手榴弹的伤害，经过特殊训练的魔法少女可以通过它发射手榴弹。"
AbilityDescName="绝望黑洞炮"

[PrimarylauncherCollateralDamage X2AbilityTemplate]
LocFriendlyName="感受绝望吧！"
LocLongDescription="向你的目标和掩体发射一连串手榴弹，对其造成严重损坏或摧毁。"
LocHelpText="向你的目标和掩体开火，对其造成严重伤害或摧毁。"
LocFlyOverText="感受绝望吧！"
LocMissMessage="这次算你运气好！"

[ScatterOverwatch X2AbilityTemplate]
LocFriendlyName="祈祷宽恕吧！"
LocLongDescription="即使没有发射手榴弹的技能，也可以通过此武器发射库存中的一连串手榴弹。"
LocHelpText="即使没有发射手榴弹的技能，也可以通过此武器发射库存中的一连串手榴弹。"
LocFlyOverText="祈祷宽恕吧！"
